# Телеграм-бот для записи в кино Лии t.me/Bali_Cinema_bot
# Главный модуль

from aiogram import Bot        # главная сущность бота
from aiogram import Dispatcher # соединяем бота и данные
from aiogram import executor   # нужен при запуске
from aiogram import types      # берём сообщение
import tokenBots               # мои токены


###################################################################################################
# Инициализация
###################################################################################################
# Переключение токенов
API_TOKEN = tokenBots.workToken # рабочий бот
# API_TOKEN = tokenBots.testToken # тестовый бот

# Инициируем бота
bot = Bot(token=API_TOKEN)
dp = Dispatcher(bot)


###################################################################################################
# Слушаем сообщения
###################################################################################################
@dp.message_handler()
async def all_mess(message: types.Message):
    await message.answer('test ok')


###################################################################################################
# Запуск бота
###################################################################################################
if __name__ == '__main__':
    executor.start_polling(dp, skip_updates=True)